Repository: eugeneai/papers-2018
Catalog: tr/tr-level2.tmx
Source language: ru_ru
Languages: en_us

source: Онтология dbr используется для обозначения конкретных сущностей, географических названий и т.п.
en_us: The dbr ontology is used to refer to a specific entity, geographical names, etc.

source: Онтология prov – основа описания информационных потоков в документах и их взаимосвязи.
en_us: The prov ontology is the base of description of information flows in documents and their relationships.

source: Опыт показывает, что преподаватели в большей части не способны справиться с качественным оформлением документов в предоставленные им временные ограничения, что приводит к необходимости руководству кафедр нанимать секретаря-специалиста, функцией которого является доведение предоставленной документации до необходимого уровня качества.
en_us: Experience shows that most instructors are not able to cope with high-quality paperwork in the given time constraints, thus requiring the departments to hire a secretary, whose function is to bring documentation to the required quality level.

source: Орлова Ирина Витальевна,
en_us: Orlova I. V.,

source: Основной проблемой, решаемой в таких системах, является обобщение хранимой информации, что позволяет, как расширять набор получаемых рекомендаций за счет смежных терминов в одной общей категории, так и сужать объем выдачи при помощи замены общих терминов узкоспециализированными, релевантными поисковому запросу.
en_us: The main problem to be solved in such systems is the generalization of stored data that allows to extend the set of derived recommendations with equivalent terms in the same general category, as well as the narrowing the retrieval result number by replacing general term with specialized ones more relevant to the search query.

source: Основные аспекты функционирования модулей рассматривается далее по тексту статьи в разделе приложений.
en_us: The main aspects of modules' function are discussed later in the article in the application section.

source: Основным форматом внутреннего представления данных LOD использован граф библиотеки rdflib.
en_us: Rdflib library is used for the internal representation the LOD graphs.

source: Особенностью хранилища является тот факт, что все тройки хранятся непосредственно в оперативной памяти, т.к. у хранилища нет специальных допущений о структуре возможных запросов.
en_us: A special feature of the store is the fact that all triples are stored directly in RAM, as storage has no special assumptions about the structure of queries, which can be issued by adjacent software.

source: От использования rel и about следует отказаться.
en_us: The use of rel and about attributes are recommended to be abandoned.

source: Отдельно от визуально контента для представления LOD используются стандартные форматы семантического веба RDF, OWL, TTL, N3 и 4, JSON-LD, RDF/JSON и др.
en_us: Separately from the visual content, standard Semantic web formats RDF, OWL, TTL, N3 and 4, JSON-LD, RDF/JSON are used for presentation to the LOD.

source: Подход к управлению содержанием сайта на основе технологий RDF // Материалы Всероссийской конференции с международным участием «Знания – Онтологии – Теории» (ЗОНТ-2013), 8 – 10 октября.
en_us: An approach to managing a site content on the base of RDF technologies // Materials of All-Russian conference with international participation "Knowledge – Ontology – Theory" (KONT-2013), 8 – 10 October.

source: Полнотекстовый поиск
en_us: Full-text search

source: Последние пять лет показали уровень продуманности принимаемых менеджерами министерства решений в части требований к представлению курса – разработано четыре поколения стандартов (1,2,3 и 3+) –, для которых требовалось представить документы в соответствующей обновленной форме.
en_us: The last five years showed the level of maturity of decisions made by the managers of the Ministry in terms of requirements to the presentation of the course - four generations of the standards (1,2,3 and 3+) are developed – for which it was required to resubmit documents in the appropriate updated form.

source: Представление графа в оперативной памяти вычислительного устройства в большинстве библиотек и программных каркасов (фреймворков) ориентировано на быстрое выполнение операций перебора и фильтрации троек по одному или нескольким параметрам, а также на поддержку запросов стандарта SPARQL.
en_us: The representation of a graph in workstation memory devices in most libraries and software frameworks are focused on fast search and filtering operations of triples according to one or more criteria, as well as the support of standard SPARQL queries.

source: При использовании HTML для представления контента в роли основного формата разметки выступает RDFa (Resource Description Framework in Attributes).
en_us: When using HTML for presentation of content, RDFa (Resource Description Framework in Attributes) is the primary markup format being supported.

source: При помощи этих классов разработчики приложений и программных агентов могут взаимодействовать с машиной логического вывода севера ClioPatria.
en_us: Using these classes application developers and software agents are able to interact with the logic inference engine of the ClioPatria server.

source: При этом содержательная информация документа связывается с содержательной информацией другого при помощи отношений – ссылок на соответствующие ресурсы.
en_us: The content document information is associated with the content information of another one by means of relations, links, to relevant resources.

source: Приведем один пример использования средств LOD и компонент архива.
en_us: Let us discuss an example of the application of digital archive services, LOD and archive components.

source: Приведен пример использования разработанных средств подготовки документов в образовательной среде и юридических документов.
en_us: An example of use of the development tools for the document synthesis in the educational environment and legal documents has been presented.

source: Приложения технологий
en_us: Application of the technologies

source: Проводимая реформа затрагивает все аспекты процесса, включая систему классификации специальностей (внедрение программ м направлений, специализация по уровням квалификации (бакалавриат, магистратура и др.), введение прикладного бакалавриата, перечень преподаваемых курсов, целей и задач курсов (согласование с компетенциями, заданными в Федеральном государственном стандарте), формы ведения занятий в вузе (введение интерактивных форм обучения), распределение лекционных и практических занятий и др.
en_us: The reform affects all aspects of the process, including the system of classification of specialties (introducing programs and directions, specialization according to skill levels (bachelor, master degrees, etc.), introduction of applied bachelor degree, list of courses, aims and objectives of the courses (negotiation with the competencies specified in the Federal standard), forms of conducting classes at Universities (introduction of interactive forms of learning), the distribution of lectures and practical sessions, etc.

source: Продолжим предыдущий пример: рассмотрим с грамматические конструкции.
en_us: Let us continue the previous example: consider a grammatical structure.

source: Проект доступен в виде модулей языка программирования Python по адресу: https://github.com/isu-enterprise.
en_us: The project is available as modules of the Python programming language at: https://github.com/isu-enterprise.

source: Проект находится в стадии активной разработки и нацелен на создание сервиса хранения графов LOD, реализующих как все стандарты хранения и доступа, так и тесную интеграцию с Prolog.
en_us: The project is under active development and aims to create a LOG graph storage service, implementing all the standards of storage and access, together with tight integration with Prolog.

source: Пролог позволяет осуществлять запросы в форматах Datalog и SPARQL, а также строить систему знаний для обработки полученных данных.
en_us: Prolog allows us to make queries in SPARQL and Datalog formats, as well as to build a knowledge system to process the received data.

source: Разметка представляет собой граф (подграф), формируемый отношениями (тройками) вида <Субъект, отношение, объект>, нанесенный на древовидную структуру HTML при помощи нескольких специальных атрибутов.
en_us: The markup is a graph (subgraph) formed by the relations (triples) of the form <Subject, relation, object>, applied to a tree structure of HTML with special attributes.

source: Разработанные средства использованы в решении ряда прикладных задач.
en_us: The designed tools used in solving a number of applied tasks.

source: Разработчиками ClioPatria создан инструментарий доступа к хранилищу несколькими способами: осуществление SPARQL-запросов по стандартному протоколу, а также запуск запросов к Prolog-системе при помощи протокола Pengines [9].
en_us: ClioPatria developers implemented repository accessing in several ways: the SPARQL queries according to a standard protocol, direct queries to the ClioPatria Prolog subsystem using Pengines Protocol [9]

source: Разработчиками LOD создан ряд ресурсов для описания информации, в том числе набор онтологий базового уровня для описания различных аспектов контента (scos, rdfs, XMLSchema, dc, prov, oa, schema.org и др.), графы, представляющие энциклопедические данные, например, Dbedia [3], Wikidata [4], Goole Knowledge Graph, сервисы автоматизации частичной семантической разметки текста, например, Dbpedia Spotlight [5], средств распределенного исполнения SPARQL-запросов.
en_us: LOD developers created a number of resources to discover vocabularies (ontologies), including a set of base-level vocabularies for describing various aspects of the content (scos, rdfs, XMLSchema, dc, prov, oa, schema.org, etc.), graphs representing encyclopedic data, for example, Dbedia [3] and Wikidata [4], the Google Knowledge Graph, services of partial automation of semantic markup of text, such as Dbpedia Spotlight [5], means of the distributed execution of SPARQL queries.

source: Рассмотрим основные свойства использованных для описания унаследованного контента онтологий.
en_us: Let us list the basic properties of used vocabularies in description of the content.

source: Рассмотрим пример текста доверенности.
en_us: Consider the example of power of attorney form representations (in Russian).

source: Рассмотрим схему представления размеченной рабочей программы в разработанной системе.
en_us: Consider the scheme of submission of marked-up work program in the proposed system.

source: Реализация и интеграция этого сервиса достаточно проста, так как любой RDF-граф представим в формате JSON (JSON-LD), при этом JSON – это основной формат хранения индексируемой информации в системе ElasticSearch, необходимо только на сервере выделить особым образом тройки, которые отвечают за представление ресурса пользователю в результатах поиска.
en_us: Implementation and integration of this service is quite simple, since every RDF graph is representable as JSON (JSON-LD), while JSON is the primary format for storing the indexed information in the ElasticSearch search engine; it is only necessary to separate a particular triples on the server, which are responsible for the representation of the resource to the user in the search results.

source: Реализация стандарта хранения графа LOD выполнена с использованием программной системы ClioPatria [8].
en_us: The implementation of metadata LOD graph storage is realized using ClioPatria [8] ontology server.

source: Результаты анализа экстракторов представляются в виде подграфа oa, связываются логически с исходным содержимым и передаются в хранилища метаданных LOD.
en_us: The results of the extractor analysis are presented as a subgraph oa, associated with the source content and stores in a metadata repository of LOD.

source: Результаты получены при активном использовании сетевой инфраструктуры Телекоммуникационного центра коллективного пользования «Интегрированная информационно-вычислительная сеть Иркутского научно-образовательного комплекса» (ЦКП ИИВС ИРНОК) (http://net.icc.ru).
en_us: The results obtained with the active use of the network infrastructure of Telecommunications of Center of collective use "Integrated information-computing network of Irkutsk scientific-educational complex" (http://net.icc.ru).

source: Ресурсы представляют собой как статическое содержимое, так и результаты запуска процедур публикации (конвертации) данных, порождающими размеченное текстовое содержимое.
en_us: Resources represent both the static contents and the results of the procedures execution publishing (converting) structural data, and generating marked-up text content.

source: Решение данной проблемы видится в разработке программной системы, позволяющей собирать тексты рабочих программ, аннотаций и ФОС из отдельных частей: перечня компетенций и распределения нагрузки (учебный план); содержания (преподаваемых тем модуля/курса) и ФОСа, тексты которых разделяется между разными версиями документов.
en_us: The solution to this problem lies in developing a software system that allows instructors to collect the texts of the work programmes, abstracts and FOS from separate parts: a list of competencies and curriculum; contents (subjects of taught module/course) and FOS, which are shared between different versions of documents.

source: С.
en_us: S.

source: Система ClioPatria обладает некоторыми средствами поиска текстовой информации по ключевым словам, однако, в архиве целесообразно использовать более мощные системы полнотекстового индекса, например, Elasticsearch [13].
en_us: The ClioPatria system has means of searching the text information for keywords, however, it is advisable to use a more powerful system of a full-text index, for example, Elasticsearch [13].

source: Система ClioPatria реализована в среде программирования SWI-Prolog.
en_us: The ClioPatria system is implemented in the SWI-Prolog programming environment.

source: Системный уровень хранилища реализован на языке C.
en_us: The system storage tier is implemented in C.

source: Согласование грамматики реализовано при помощи атрибутов id, data- и class.
en_us: Harmonization of grammar is implemented using the aid, data- and class attributes.

source: Содержание страницы кодируется структурой ее URL и сверстывается в момент первого обращения.
en_us: The page content is encoded by the structure of its URL and rendered at the time of first request.

source: Содержимое (байты, текст), хранимое в kyotocabinet идентифицируется его 128-битным murmur3-хэшем, что позволяет создавать отображения ключ (хэш) на содержимое и обратно.
en_us: The contents (bytes, text) stored in Kyotocabinet is identified by its 128-bit murmur3 hash that allows us to create a reference key (hash) to the contents and backward.

source: Создаваемые документы хранятся на серверах, поддерживающих протокол HTTP.
en_us: Forming documents are stored on servers that support the HTTP Protocol.

source: Созданные программные средства и технологии направлены на разработку программной среды глобального электронного документооборота, позволяющего физическим лицам и организациям обмениваться документами, логическая структура которых трудноформализуема в рамках традиционных средств автоматизации документооборота.
en_us: The created software tools and technologies aimed at the development of a software infrastructure of a global electronic document flow, allowing individuals and organizations to share documents, whose logical structure is partially formalizable within the framework of the traditional software of document automation.

source: Созданные ресурсы позволяют разрабатывать механизмы интеграции данных графов, распределенных в сети интернет, в единую информационную среду.
en_us: Created resources allow us to develop integration engines for data and graph distributed in the Internet into a single information infrastructure.

source: Средств Microsoft Word и Excel, стандартно используемых для решения этой задачи, со встроенным VBA явно недостаточно.
en_us: Microsoft Word and Excel means, that are commonly used for this task with a built-in VBA, are clearly not enough.

source: Средства логического вывода
en_us: The inference machine

source: Средства цифрового архива
en_us: Digital archive tools

source: Стандарт этой отологии принят в 2017 году, ее основная задача представлять содержимое (аннотацию), описывающее другое содержимое.
en_us: The vocabulary standard is adopted in 2017, it is used to represent the content annotation describing other content.

source: Страница, отображаемая пользователю, – это аннотация документа "#annotation", причем и аннотируемое содержимое, и текст аннотации – это одно и то же на этапе формирования документа: ресурс "#course-work-program".
en_us: The page displayed to the user is the abstract of the document "#annotation", and both the annotated content and the annotation text is the same at the stage of formation of the document - resource "#course-work-program".

source: Существует несколько бинарных форматов, ориентированных на компактное хранение графов в файловой системе.
en_us: There are several binary formats that support compact storage of the graphs in the file system.

source: Существующая документация курса дополнена новыми формами обязательных документов – фондом оценочных средств (ФОС), аннотациями курсов.
en_us: The existing documentation is supplemented by new forms of mandatory documents: the Fund of assessment tools (FOS), annotations of courses.

source: Т.
en_us: Vol.

source: Таким образом, оперативная память сервера – это критический ресурс хранилища.
en_us: Thus, server memory space is a critical resource of the repository.

source: Текст разбивается на разделы, обрамляется тегами <div> и <span> со соответствующими структурами RDFa.
en_us: The text is divided into sections, surrounded by tags <div> and <span> with the relevant RDFa structures.

source: Технологии LOD
en_us: Technologies of LOD

source: Технологии LOD базируются на представлении публикуемой информации в виде семантически размеченного документа, веб-страницы, результата запроса к базе данных (контента).
en_us: The technologies of LOD are based on the representation of the published information in the form of semantically marked-up document, usually web page of a result of a database query (content).

source: Технология открытых связанных данных (Linked Open Data, LOD) [1] предложена W3C-консорциумом для представления семантической информации в публикуемых данных таким образом, чтобы обеспечить не только возможность ее обработки при помощи программных агентов (Семантичекий Веб), но и связать всю имеющуюся информацию в единый семантический граф при помощи отношений и универсальных глобальных идентификаторов ресурсов (URI).
en_us: Technology linked open data (Linked Open Data, LOD) [1] was suggested by the W3C consortium to represent the semantic information in the data published in order to provide the possibility of its processing with software agents (Semanticheskii Web), as well as to link all available information into a single semantic graph using relations and universal resource identifiers (URIs).

source: Титульные листы формируются также из данных учебного плана и подготовленных шаблонов.
en_us: The title pages are generated also from data of curriculum and templates set by the management.

source: Титульный лист и лист согласования вставляются со страницы шаблонов “imei.html” (сведения об Институте математики, экономики и информатики Иркутского государственного университета).
en_us: The title page and the approval sheet are inserted from the templates page “imei.html” (information about the Institute of mathematics, economics and informatics of Irkutsk state university).

source: Форма class=“disp” задает возможность подстановки фразы, идентифицированной id, в текст данного тега.
en_us: Attribute class=“disp” specifies the substitution of a phrase identified by id, in the text of the tag.

source: Формат представления базируется на результатах из [14,15].
en_us: The presentation format is based on the results in [14,15].

source: Хранение документов LOD
en_us: Storing LOD documents

source: Хранилище использует компактные структуры данных для представления троек в оперативной памяти, а также на диске.
en_us: The store uses compact data structures to represent triples in RAM and on hard disk.

source: Хранилище метаданных
en_us: The metadata store

source: Хэш является идентификатором содержимого в LOD.
en_us: The hash is a content identifier in LOD.

source: Целью исследования является создание средств разработки цифровых архивов, позволяющих проектировать и реализовать предметно-ориентированные хранилища информационных объектов.
en_us: The aim of the study is creating tools for developing digital archives to design and implement a domain-specific repositories of information objects.

source: Черкашин Е.А., Белых П.В.
en_us: Cherkashin, E. A., Belykh, P. V.

source: Черкашин Евгений Александрович,
en_us: Cherkashin E. A.,

source: Шаблоны текста обозначаются атрибутом id.
en_us: Text templates are indicated by the id attribute.

source: Экстракторы анализируют содержимое и пытаются получить информацию о текстовом содержимом, авторе, времени создания контента и др.
en_us: The extractors analyze the content and try to acquire information about text content, author, time of content creation, format, etc.

source: Экстраторы реализованы на основе утилит file, extract (libextract), tracker и recoll.
en_us: Extractors are implemented on the basis of the utilities file, extract (libextract), tracker and recoll.

source: Это делает структуру семантической разметки более строгой за счет уменьшения количества сущностей.
en_us: This makes the structure of semantic markup to be more strict by reducing the number of entities used.

source: Это позволяет создавать средства визуализации содержимого графа, например, строить интерфейсы администратора хранилищ.
en_us: This allows one to create visualization of the contents of the graph, for example, to build the administrator interfaces for the repositories.

source: Этот набор составляется для каждой возможной комбинации: вуз, кафедра, специальность, направление (профиль), программа, квалификация (бакалавр, специалист, магистрант, аспирант), академический или прикладной вариант квалификации, форма обучения (очная, заочная, вечерняя, очно-заочная и др.).
en_us: This set is realized for each possible combination of a course parameters: the university, the department, specialty, direction (profile), programme, qualification (bachelor, specialist, undergraduate, graduate), academic or applied version of the qualification, form of study (full-time, part-time, evening, etc.).

source: и др.
en_us: et al.

source: н., старший научный сотрудник,
en_us: PhD, senior researcher,

source: сервис анализа хранимого контента и комплектации архива семантической информацией, описывающей контент;
en_us: service for analysis of the stored content enriching of the archive with semantic information describing the content;

source: средства разработки приложений LOD и их пользовательских интерфейсов.
en_us: the tools for development of LOD applications and their user interfaces.

source: тел.
en_us: tel.

source: хранилища контента и метаданных с доступом SPARQL, полнотекстовым поиском и возможностью обработки LOD, основанной на формализованных знаниях;
en_us: content and metadata repository with SPARQL and full-text search; the engines for LOD processing, based on the formalized knowledge;
